<a href="https://colab.research.google.com/github/SurajGavade01/Suraj_31_DEC_2025_Bank/blob/main/DataSet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('/content/car_price_dataset.csv')
df.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         10000 non-null  object
 1   Model         10000 non-null  object
 2   Year          10000 non-null  int64
 3   Engine_Size   10000 non-null  float64
 4   Fuel_Type     10000 non-null  object
 5   Transmission  10000 non-null  object
 6   Mileage       10000 non-null  int64
 7   Doors         10000 non-null  int64
 8   Owner_Count   10000 non-null  int64
 9   Price         10000 non-null  int64
dtypes: float64(1), int64(5), object(4)
memory usage: 781.4+ KB

1.what is the average. price of all the cars in the datasets?

In [8]:
avg = df['Price'].mean()
print(f'the average price of all the cars in the dataset {avg}')

the averge price of all the cars in the dataset 8852.9644

2. which car brand has the highest averge price ?

In [13]:
s = df.groupby('Brand')['Price'].mean().idxmax()

print(f'the car brand with the highest averge price is {s}')

the car brand with the highest averge price is Chevrolet

#3. What is the most common fuel type in the dataset?
#4.How many cars have a mileage greater than 200,000?
#5.WHat is the distribution of cars by transmission type?
#6.Which car model has the highest price?
#7.WHat is the average price of cars by fuel type?
#8.How many cars are from the year 2020 or later?
#9.what is the average engine size for each brand?
#10.Which car has the lowest mileage?

#3. What is the most common fuel type in the dataset?

In [22]:
s = df['Fuel_Type'].value_counts().idxmax()
print(f'The most common fuel type in the dataset is: {s}')

The most common fuel type in the dataset is: Electric

4.How many cars have a mileage greater than 200,000?

In [34]:
len(df[df['Mileage']>200000])

3290

6.Which car model has the highest price?

In [57]:
df.loc[df['Price'].idxmax(), ['Model', 'Price']].tolist()

['Corolla', np.int64(18301)]

#7.WHat is the average price of cars by fuel type?

In [45]:
df.groupby('Fuel_Type')['Price'].mean()

Fuel_Type
Diesel       8117.336385
Electric    10032.220190
Hybrid       9113.030167
Petrol       8070.561826
Name: Price, dtype: float64

How many cars are from the year 2020 or later?

In [61]:
len(df[df['Year'] >= 2020])

1651

what is the average engine size for each brand?

In [67]:
df.groupby('Brand')['Engine_Size'].mean()

Brand
Audi          3.032948
BMW           2.976877
Chevrolet     2.993719
Ford          3.044275
Honda         2.925966
Hyundai       2.936683
Kia           3.053791
Mercedes      3.069745
Toyota        2.961443
Volkswagen    3.011078
Name: Engine_Size, dtype: float64

In [68]:
df.groupby('Brand')['Engine_Size'].mean().idxmax()

'Mercedes'

10.Which car has the lowest mileage?

In [71]:
df.groupby('Brand')['Mileage'].min().idxmin()

'Ford'

11. What is the correlation between mileage and price?

12.How many cars have more than 2 owners?

In [86]:
len(df[df['Owner_Count'] > 2])

5944

13.13. What is the average price of cars by year?

In [83]:
df.groupby('Year')['Price'].mean()

Year
2000     5393.735369
2001     5904.064039
2002     5956.751082
2003     6225.834646
2004     6330.725888
2005     6943.037123
2006     7249.961446
2007     7632.513953
2008     7728.418848
2009     8083.917293
2010     8503.419954
2011     8622.855234
2012     9011.446224
2013     9114.208531
2014     9587.455635
2015     9896.774648
2016    10177.600000
2017    10343.757506
2018    10939.192941
2019    11132.722090
2020    11495.284337
2021    11637.813299
2022    12067.690176
2023    12169.470982
Name: Price, dtype: float64

In [84]:
df.groupby('Year')['Price'].mean().idxmax()

np.int64(2023)

14.Which car has the highest number of doors?

In [81]:
df.groupby('Brand')['Doors'].max()

Brand
Audi          5
BMW           5
Chevrolet     5
Ford          5
Honda         5
Hyundai       5
Kia           5
Mercedes      5
Toyota        5
Volkswagen    5
Name: Doors, dtype: int64

In [82]:
df.groupby('Brand')['Doors'].max().idxmax()

'Audi'

15. What is the average mileage for each fuel type?

In [76]:
df.groupby('Fuel_Type')['Mileage'].mean()

Fuel_Type
Diesel      150261.533041
Electric    151059.307429
Hybrid      145577.587036
Petrol      149917.694606
Name: Mileage, dtype: float64

16.How many cars are from the brand 'Toyota'?

In [79]:
len(df[df['Brand'] == 'Toyota'])

970

17.What is the average price of cars with automatic transmission?